数据重构

In [7]:
import numpy as np
import pandas as pd

text = pd.read_csv('/Users/ousei/Documents/数据分析/Datawhale/hands-on-eda/阿日的笔记/data/train-left-up.csv')
text.head()

   PassengerId  ...                                               Name
0            1  ...                            Braund, Mr. Owen Harris
1            2  ...  Cumings, Mrs. John Bradley (Florence Briggs Th...
2            3  ...                             Heikkinen, Miss. Laina
3            4  ...       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4            5  ...                           Allen, Mr. William Henry

[5 rows x 4 columns]

In [8]:
#数据的合并

#观察几个数据
text_left_up = pd.read_csv("data/train-left-up.csv")
text_left_down = pd.read_csv("data/train-left-down.csv")
text_right_up = pd.read_csv("data/train-right-up.csv")
text_right_down = pd.read_csv("data/train-right-down.csv")

In [9]:
text_left_up.head()

   PassengerId  ...                                               Name
0            1  ...                            Braund, Mr. Owen Harris
1            2  ...  Cumings, Mrs. John Bradley (Florence Briggs Th...
2            3  ...                             Heikkinen, Miss. Laina
3            4  ...       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4            5  ...                           Allen, Mr. William Henry

[5 rows x 4 columns]

In [11]:
text_left_down.head()

   PassengerId  Survived  Pclass                                         Name
0          440         0       2       Kvillner, Mr. Johan Henrik Johannesson
1          441         1       2  Hart, Mrs. Benjamin (Esther Ada Bloomfield)
2          442         0       3                              Hampe, Mr. Leon
3          443         0       3                    Petterson, Mr. Johan Emil
4          444         1       2                    Reynaldo, Ms. Encarnacion

In [12]:
text_right_up.head()

      Sex   Age  SibSp  Parch            Ticket     Fare Cabin Embarked
0    male  22.0    1.0    0.0         A/5 21171   7.2500   NaN        S
1  female  38.0    1.0    0.0          PC 17599  71.2833   C85        C
2  female  26.0    0.0    0.0  STON/O2. 3101282   7.9250   NaN        S
3  female  35.0    1.0    0.0            113803  53.1000  C123        S
4    male  35.0    0.0    0.0            373450   8.0500   NaN        S

In [13]:
text_right_down.head()

      Sex   Age  SibSp  Parch        Ticket    Fare Cabin Embarked
0    male  31.0      0      0    C.A. 18723  10.500   NaN        S
1  female  45.0      1      1  F.C.C. 13529  26.250   NaN        S
2    male  20.0      0      0        345769   9.500   NaN        S
3    male  25.0      1      0        347076   7.775   NaN        S
4  female  28.0      0      0        230434  13.000   NaN        S

In [14]:
#合并up
list_up = [text_left_up,text_right_up]
result_up = pd.concat(list_up,axis=1)
result_up.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0          1.0       0.0     3.0  ...   7.2500   NaN         S
1          2.0       1.0     1.0  ...  71.2833   C85         C
2          3.0       1.0     3.0  ...   7.9250   NaN         S
3          4.0       1.0     1.0  ...  53.1000  C123         S
4          5.0       0.0     3.0  ...   8.0500   NaN         S

[5 rows x 12 columns]